spec/support/vcr_cassettes/preneeds/discharge_types/gets_a_list_of_discharge_types.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:getDischargeTypes></tns:getDischargeTypes></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 16 Jun 2017 03:38:17 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*83220d10-3e7b-4bee-91a9-fbf5bff60872@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:83220d10-3e7b-4bee-91a9-fbf5bff60872";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:83220d10-3e7b-4bee-91a9-fbf5bff60872\r\nContent-Id: <rootpart*83220d10-3e7b-4bee-91a9-fbf5bff60872@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:getDischargeTypesResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><description>Honorable</description><id>1</id></return><return><description>General</description><id>2</id></return><return><description>Entry
        Level Separation/Uncharacterized</description><id>3</id></return><return><description>Other
        Than Honorable</description><id>4</id></return><return><description>Bad Conduct
        Discharge</description><id>5</id></return><return><description>Dishonorable</description><id>6</id></return><return><description>Other</description><id>7</id></return></ns2:getDischargeTypesResponse></S:Body></S:Envelope>\r\n--uuid:83220d10-3e7b-4bee-91a9-fbf5bff60872--"
    http_version:
  recorded_at: Fri, 16 Jun 2017 03:38:17 GMT
recorded_with: VCR 3.0.3
